{
"id": 634425,
"image": "https://img.spoonacular.com/recipes/634425-556x370.jpg",
"imageType": "jpg",
"title": "Basil Coconut Ice Cream",
"readyInMinutes": 45,
"servings": 8,
"sourceUrl": "https://spoonacular.com/basil-coconut-ice-cream-634425",
"vegetarian": true,
"vegan": false,
"glutenFree": true,
"dairyFree": false,
"veryHealthy": false,
"cheap": false,
"veryPopular": false,
"sustainable": false,
"lowFodmap": false,
"weightWatcherSmartPoints": 15,
"gaps": "no",
"preparationMinutes": null,
"cookingMinutes": null,
"aggregateLikes": 5,
"healthScore": 2,
"creditsText": "Foodista.com – The Cooking Encyclopedia Everyone Can Edit",
"license": "CC BY 3.0",
"sourceName": "Foodista",
"pricePerServing": 107.97,
"extendedIngredients": [],
"summary": "Basil Coconut Ice Cream is a dessert that serves 8. One portion of this dish contains roughly <b>3g of protein</b>, <b>23g of fat</b>, and a total of <b>283 calories</b>. For <b>$1.08 per serving</b>, this recipe <b>covers 7%</b> of your daily requirements of vitamins and minerals. This recipe from Foodista requires basil leaves, salt, honey, and half & half. It will be a hit at your <b>Summer</b> event. 5 people were impressed by this recipe. It is a good option if you're following a <b>gluten free, lacto ovo vegetarian, and primal</b> diet. From preparation to the plate, this recipe takes roughly <b>45 minutes</b>. All things considered, we decided this recipe <b>deserves a spoonacular score of 28%</b>. This score is not so amazing. If you like this recipe, you might also like recipes such as <a href=\"https://spoonacular.com/recipes/coconut-and-thai-basil-ice-cream-best-lick-2008-ice-cream-c-53984\">Coconut And Thai Basil Ice Cream Best Lick! 2008 Ice Cream C</a>, <a href=\"https://spoonacular.com/recipes/janines-blueberry-basil-ice-cream-best-lick-2008-ice-cream-51791\">Janine's Blueberry Basil Ice Cream Best Lick! 2008 Ice Cream</a>, and <a href=\"https://spoonacular.com/recipes/roasted-strawberry-coconut-milk-ice-cream-vegan-tips-for-making-your-homemade-ice-cream-soft-814136\">Roasted Strawberry Coconut Milk Ice Cream (Vegan) + Tips for Making Your Homemade Ice Cream Soft</a>.",
"cuisines": [],
"dishTypes": [],
"diets": [],
"occasions": [],
"instructions": "Heat coconut milk and cream on the stove over medium high in a saucepan until hot and barely bubbling (bring to a low boil). Add honey and salt; mix to dissolve. Add basil leaves, stir and allow them to wilt in the mixture; remove saucepan from heat. Pour mixture into a blender and emulsify until completely creamy and no chunks of basil are visible (if this is not possible in your blender you can strain out the basil pieces with a fine wire strainer/colander if you would like or you can leave the basil pieces in the mixture). Allow mixture to cool 20 minutes; this allows the flavors to infuse. Pour mixture in a large container and refrigerate a few hours until cool. If using an ice cream maker, follow the instructions on your ice cream maker accordingly (the one I used sits on the counter. You just plug it in, turn it on chill mode, allow the built-in bowl to get cool, then pour in the ice cream mixture. You then turn on the churn setting and turn the timer on for 25 minutes. It works its magic and you have wonderful ice cream by the time dinner is consumed). You can also try this without an ice cream maker by putting the mixture in a freezer-safe container and stirring with a spoon every hour for roughly 8 10 hours. If you try this without an ice cream maker, small ice crystals will form and the consistency will not be as creamy as youd get when using an ice cream maker, but it will still be damn delicious! Side note: We had leftovers when I made this and we froze them in a Tupperware container. The ice cream gets to be frozen solid so when you go to eat the leftovers, make sure you thaw the ice cream at least 10 minutes before attempting to dig in.",
"analyzedInstructions": [],
"originalId": null,
"spoonacularScore": 35.19651412963867,
"spoonacularSourceUrl": "https://spoonacular.com/basil-coconut-ice-cream-634425"
}